interface MessageSection {
    title: string;
    content: string;
}

export const MessageArray: MessageSection[] = [
    {
        title: "Intro นิดนึง",
        content: `你好！ ถ้าเราอ่านข้อความนี้อยู่พี่เดาว่าคงเป็นตอนที่เราเข้าเกทแล้ว หรือถ้าหลังจากนั้นอาจเป็นเพราะพี่ทำเว็บไม่ทัน 53535353 
เสียดายเราไม่ให้พี่ไปส่ง (พี่อยากไปส่งเรามากๆ) สิ่งนี้จะเป็นข้อความความรู้สึกของพี่ในระยะเวลา 2.5 เดือนที่ผ่านมา เปิดเสียงฟังเพลงระหว่างอ่านไปด้วยก็ดีนะ อ่านหน้าถัดไปปัดขวานะๆๆ
`
    },
    {
        title: "ขอโทษ",
        content: `อยากเริ่มด้วยคำว่า “ขอโทษ” พี่เชื่อว่าเราคง งง ขอโทษอะไรวะ 5252525 ก็ในช่วงนี้ที่เรากลับมาถ้าพี่ทำอะไรให้เราไม่สบายใจ อึดอัด พี่ขอโทษด้วยนะ ไม่ได้อยากให้เรารู้สึกแบบนั้นเลย ขอโทษที่บางครั้งพี่อาจเห็นแก่ตัวพาเราเสียเวลานั่งรถเล่น 52525252552 และสำคัญที่สุด ก็ขอโทษที่พี่อาจเป็นพี่เหมือนเดิมไม่ได้นะ เชื่อว่าถ้าพี่ขอโทษตอนอยู่กับเรา เราคงตอบว่า ปันชิวๆ ไม่ได้อะไร
`
    },
    {
        title: "ขอบคุณ",
        content: ` และพี่ก็อยาก “ขอบคุณ” เรามากๆ ที่อยู่กับพี่ในหลายๆวัน อยู่กับเราบ่อยมากจริงๆ 525525252 กลับมารอบนี้พี่ attached กับเรามากเรยร่ะขอบคุณที่ยังไปไหนมาไหนกับพี่ ขอบคุณที่คอยตอบแชทตอนพี่เหงา ขอบคุณที่รับสายเวลาพี่ซึม ขอบคุณที่ยังไม่หายไปไหนถึงแม้ว่าพี่จะเปลี้ยนไปก็ตาม เราสำคัญต่อชีวิตพี่มากจริงๆ พูดตรงๆ ไม่มีวันไหนที่พี่ไม่คิดถึงเราเลย ตั้งแต่ตอนฝึกงานจนถึงตอนนี้ (อาการฉันหนักมากจ๊ะ)
`
    },
    {
        title: "คำอวยพร",
        content: ` และพี่ก็อยาก “อวยพร” น้องปี2คนนี้ ขอให้เทอมนี้ในฐานะที่เป็นพี่ปี 2 เทอมแรก ขอให้เราได้เรียนรู้และเติบโตให้เต็มที่ ได้เจอคนที่ดีดูแลเราดีกว่าพี่ พี่ appretiate ทุกๆอย่างในตัวเราจริงๆนะ เราเป็นคนที่เก่งมากๆ ดูแลคนรอบตัวเสมอ ไหนจะ 6 ภาษา (ไทย,ไทยใต้, อิ้ง, จีน, เกาหลี, อินโด) อีก เราเป็นแรงบันดาลใจให้พี่เรียนจีน และ เราเป็นคนที่พี่อยากดูแลที่สุด พี่รู้ว่าเราสามารถจัดการหลาย ๆ อย่างได้ด้วยตัวเองอยู่แล้ว เราเก่งในการใช้ชีวิตมาก ๆ แต่พี่แค่อยากช่วยให้เราสบายขึ้นอีกนิดเท่านั้นเอง (หรือพี่ทำให้ลำบากขึ้นวะ 5555555)
`
    },
    {
        title: "สุดท้ายนี้",
        content: `เวลาเราเครียด หรือทุกข์ใจอะไร สามารถโทรหาพี่ได้เสมอ ได้ทุกเรื่องเลยไม่ใช่แค่เรื่องTech พี่สัญญาว่าจะไม่หายไปจากชีวิตเรา พี่จะอยู่ตรงนี้เสมอ ในวันไหนถ้าว่างๆ เหงาๆ ทักมาคุยกับพี่ได้นะ พี่เหงามาก ทุกวันนี้พี่ก็แอบสงสัยไม่ได้ว่าหลังจากที่พี่สารภาพบาปกับเราไป เราจะยังชวนพี่ไปเที่ยวเหมือนตอนนั้นอีกไหม จะยังชวนพี่ไปไหนมาไหนด้วยกันรึเปล่า จะรำคาญพี่ไหมเจอกันบ่อยเกิน 5252525525 แต่สำหรับพี่ทุกครั้งที่ได้เจอเราแม้ว่ามันจะเป็นแค่ช่วงเวลาสั้นๆ แต่พี่ก็แฮปปี้มากๆนะ
พี่ก็ได้บอกทุกอย่างที่พี่รู้สึกแล้ว พี่พร้อมรับฟังเราทุกๆเรื่องนะ ขอแค่เราสบายใจก็พอแล้ว
`,
    },
];

export const footerMessage: string =
    "ขอบคุณที่อ่านมาถึงตรงนี้นะ :) \n จากพี่ชายที่รักเรามากๆ";
